Junior Year/January 2019/Assignment 5/Additional Task 3/TUT9/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
125000
(
(12.6919 -25.7618 7.10413)
(9.18401 -20.2845 6.48022)
(4.22725 -10.3355 3.36979)
(2.79531 -7.2015 2.33082)
(2.04424 -5.46981 1.76111)
(1.55419 -4.27643 1.37172)
(1.20539 -3.3792 1.08057)
(0.943445 -2.67014 0.851461)
...
)
;

boundaryField
{
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            fixedValue;
        value           uniform (20 0 0);
    }
    outlet
    {
        type            outletInlet;
        outletValue     uniform (10 0 0);
        value           uniform (10 0 0);
    }
    frontAndBack
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
